# NotAllowedToRemoveAllElements Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElementFailures..::..NotAllowedToRemoveAllElements Property
BuiltInFailures..::..ElementFailures Class See Also
---
You cannot removed all the elements from current solution. At least there should be two elements in the solution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotAllowedToRemoveAllElements { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotAllowedToRemoveAllElements As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotAllowedToRemoveAllElements {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElementFailures Class
Autodesk.Revit.DB Namespace